-- 1.Проанализировать какие запросы могут выполняться наиболее часто в процессе работы приложения и добавить необходимые индексы.


/*
2.Задание на оконные функции
 -- Построить запрос, который будет выводить следующие столбцы:
 -- имя группы
 -- среднее количество пользователей в группах (сумма количестива пользователей во всех группах делённая на количество групп)
 -- самый молодой пользователь в группе (желательно вывести имя и фамилию)
 -- самый старший пользователь в группе (желательно вывести имя и фамилию)
 -- количество пользователей в группе
 -- всего пользователей в системе (количество пользователей в таблице users)
 -- отношение в процентах для последних двух значений (общее количество пользователей в группе / всего пользователей в системе) * 100
*/